app/controllers/contents_controller.rb

  def destroy
    @content = Content.find(params[:id])
    @content.destroy
---
DELETE FROM "contents" WHERE "id" = 1