app/controllers/contents_controller.rb

  def index
    @contents = Content.all
---
SELECT * FROM "contents"

  def show
    @content = Content.find(params[:id])
---
SELECT * FROM "contents" WHERE ("contents"."id" = 1)

  def new
    @content = Content.new

    if params[:location].nil?
      flash[:error] = "Can't create content without a location!"
      redirect_to :back rescue redirect_to packages_url
      return
    end

    @content.location = Location.find_by_id(params[:location])
---
SELECT * FROM "locations" WHERE ("locations"."id" = '1') LIMIT 1

  def edit
    @content = Content.find(params[:id])
---
SELECT * FROM "contents" WHERE ("contents"."id" = 1)

  def create
    @content = Content.new(params[:content])

    if @content.save
---
INSERT INTO "contents" ("name", "added", "created_at", "item_content_type", "updated_at", "item_file_size", "tags", "deleted", "order", "item_file_name", "location_id", "item_updated_at") VALUES('Sparta', 2, '2010-05-17 01:10:40', 'application/pdf', '2010-05-17 01:10:40', 38831, '', NULL, NULL, 'carta_1201000000188.pdf', 2, '2010-05-17 01:10:40')

  def destroy
    @content = Content.find(params[:id])

    if @content.toggle_deleted
---
SELECT * FROM "contents" WHERE ("contents".location_id = 2) AND ((contents.added > 1) AND ("contents".location_id = 2))
UPDATE "contents" SET "updated_at" = '2010-05-16 21:38:06', "deleted" = 1 WHERE "id" = 2