app/controllers/locations_controller.rb

  def destroy
    @location = Location.find(params[:id])

    if @location.toggle_deleted
---
UPDATE "locations" SET "updated_at" = '2010-05-18 02:29:38', "deleted" = 0 WHERE "id" = 4