app/controllers/locations_controller.rb

SELECT * FROM "packages"
---
  def index
    @packages = Package.all

SELECT * FROM "locations" WHERE ("locations"."id" = 1)
SELECT * FROM "contents" WHERE ("contents".location_id = 2) AND ((contents.added <= 1) AND ("contents".location_id = 2))
SELECT * FROM "locations" ORDER BY locations.id DESC LIMIT 1
SELECT sum("contents".item_file_size) AS sum_item_file_size FROM "contents" WHERE (((contents.added <= 1) AND ("contents".location_id = 1)) AND ("contents".location_id = 1))
---
  def show
    @location = Location.find(params[:id])
    @size = @location.contents.sum('item_file_size').bytes

SELECT * FROM "packages" WHERE ("packages"."id" = '1') LIMIT 1
---
  def new
    @location = Location.new

    if params[:package].nil?
      flash[:error] = 'Can\'t create a location without a package!'
      redirect_to :back rescue redirect_to packages_url
      return
    end

    @location.package = Package.find_by_id(params[:package])

SELECT * FROM "locations" WHERE ("locations"."id" = 1)
---
  def edit
    @location = Location.find(params[:id])

INSERT INTO "locations" ("name", "coordinates", "package_id", "added", "created_at", "updated_at", "deleted", "tags") VALUES('Room100', '', 1, 8, '2010-05-18 06:09:18', '2010-05-18 06:09:18', 0, NULL)
---
  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save

SELECT * FROM "locations" WHERE ("locations".package_id = 4) AND ((locations.added > 7) AND ("locations".package_id = 4))
DELETE FROM "locations" WHERE "id" = 7
---
  def destroy
    @location = Location.find(params[:id])
    @location.destroy