app/controllers/packages_controller.rb

  def index
    @packages = Package.all
---
SELECT * FROM "packages" WHERE (version > 0)

  def show
    @package = Package.find(params[:id])
---
SELECT * FROM "packages" WHERE ("packages"."id" = 1)

  def edit
    @package = Package.find(params[:id])
---
SELECT * FROM "packages" WHERE ("packages"."id" = 1)

  def create
    @package = Package.new(params[:package])

    respond_to do |format|
      if @package.save
---
INSERT INTO "packages" ("name", "created_at", "updated_at", "version") VALUES('FraunhoferAICOS', '2010-05-12 13:45:28', '2010-05-12 13:45:28', 0)

  def update
    @package = Package.find(params[:id])

    respond_to do |format|
      if @package.update_attributes(params[:package])
---
SELECT * FROM "packages" WHERE ("packages"."id" = 1)
UPDATE "packages" SET "version" = 2, "updated_at" = '2010-05-19 14:53:15' WHERE "id" = 3

  def destroy
    @package = Package.find(params[:id])
    @package.destroy
---
SELECT * FROM "packages" WHERE ("packages"."id" = 2)
DELETE FROM "packages" WHERE "id" = 2